Revit 2026 API

# FilterStringRuleEvaluator Properties

---

The FilterStringRuleEvaluator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FilterStringRuleEvaluator Class

Autodesk.Revit.DB Namespace